app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Comment"], ["text", "Another test comment"], ["created_at", "2018-04-24 12:26:28.217305"], ["updated_at", "2018-04-24 12:26:28.217305"]]
---
	def create
		@post = Post.new(post_params)

		 if @post.save